In [3]:
import database as db
from table import print_table

In [3]:
res = await db.execute("""
    create table if not exists locations (
        location_id int PRIMARY KEY,
        city varchar(30),
        postal_code varchar(12)
    );
""")

In [ ]:
res = await db.execute("""
    insert into locations
    values
    (1, 'Roma', '00989'),
    (2, 'Venice', '10934'),
    (3, 'Tokyo', '1689'),
    (4, 'Hiroshima', '6823'),
    (5, 'Southlake', '26192'),
    (6, 'South San Francisco', '99236'),
    (7, 'South Brunswick', '50090'),
    (8, 'Seattle', '98199'),
    (9, 'Toronto', 'M5V 2L7'),
    (10, 'Whitehorse', 'YSW 9T2');
""")

print(f"Added {res.rowcount} rows")

Added 10 rows

In [18]:
res = await db.execute("select * from locations;")
print_table(["id", "city", "postal_code"], res.fetchall())

+----+---------------------+-------------+
| id |         city        | postal_code |
+----+---------------------+-------------+
| 1  |         Roma        |    00989    |
| 2  |        Venice       |    10934    |
| 3  |        Tokyo        |     1689    |
| 4  |      Hiroshima      |     6823    |
| 5  |      Southlake      |    26192    |
| 6  | South San Francisco |    99236    |
| 7  |   South Brunswick   |    50090    |
| 8  |       Seattle       |    98199    |
| 9  |       Toronto       |   M5V 2L7   |
| 10 |      Whitehorse     |   YSW 9T2   |
+----+---------------------+-------------+

In [ ]:
res = await db.execute("""
    alter table employees
    add location_id int,
    add foreign key(location_id) references locations(location_id);
""")

In [ ]:
await db.execute("""
    create sequence seq
    increment 1
    minvalue 1
    maxvalue 10
    start with 1
    cycle;
""")

res = await db.execute("""
    update employees
    set location_id = nextval('seq')
    returning *;
""")

print_table(["id", "first_name", "last_name", "job_id", "salary", "manager_id", "department_id", "location_id"], res.fetchall())

+----+-------------+-------------+------------+--------+------------+---------------+-------------+
| id |  first_name |  last_name  |   job_id   | salary | manager_id | department_id | location_id |
+----+-------------+-------------+------------+--------+------------+---------------+-------------+
| 1  |    Steven   |     King    |  AD_PRES   | 24000  |    None    |       90      |      1      |
| 2  |    Neena    |   Kochhar   |   AD_VP    | 17000  |     1      |       90      |      2      |
| 3  |     Lex     |   De Haan   |   AD_VP    | 17000  |     1      |       90      |      3      |
| 4  |  Alexander  |    Hunold   |  IT_PROG   |  9000  |     3      |       60      |      4      |
| 5  |    Bruce    |    Ernst    |  IT_PROG   |  6000  |     4      |       60      |      5      |
| 6  |    David    |    Austin   |  IT_PROG   |  4800  |     4      |       60      |      6      |
| 7  |    Valli    |  Pataballa  |  IT_PROG   |  4800  |     4      |       60      |      7      |
| 8  |    Diana    |   Lorentz   |  IT_PROG   |  4200  |     4      |       60      |      8      |
| 9  |    Nancy    |  Greenberg  |   FI_MGR   | 12008  |     2      |      100      |      9      |
| 10 |    Daniel   |    Faviet   | FI_ACCOUNT |  9000  |     9      |      100      |      10     |
| 11 |     John    |     Chen    | FI_ACCOUNT |  8200  |     9      |      100      |      1      |
| 12 |    Ismael   |   Sciarra   | FI_ACCOUNT |  7700  |     9      |      100      |      2      |
| 13 | Jose Manuel |    Urman    | FI_ACCOUNT |  7800  |     9      |      100      |      3      |
| 14 |     Luis    |     Popp    | FI_ACCOUNT |  6900  |     9      |      100      |      4      |
| 15 |     Den     |   Raphaely  |   PU_MAN   | 11000  |     1      |       30      |      5      |
| 16 |  Alexander  |     Khoo    |  PU_CLERK  |  3100  |     15     |       30      |      6      |
| 17 |    Shelli   |    Baida    |  PU_CLERK  |  2900  |     15     |       30      |      7      |
| 18 |    Sigal    |    Tobias   |  PU_CLERK  |  2800  |     15     |       30      |      8      |
| 19 |     Guy     |    Himuro   |  PU_CLERK  |  2600  |     15     |       30      |      9      |
| 20 |    Karen    |  Colmenares |  PU_CLERK  |  2500  |     15     |       30      |      10     |
| 21 |   Matthew   |    Weiss    |   ST_MAN   |  8000  |     1      |       50      |      1      |
| 22 |     Adam    |    Fripp    |   ST_MAN   |  8200  |     1      |       50      |      2      |
| 23 |    Payam    |   Kaufling  |   ST_MAN   |  7900  |     1      |       50      |      3      |
| 24 |    Shanta   |   Vollman   |   ST_MAN   |  6500  |     1      |       50      |      4      |
| 25 |    Kevin    |   Mourgos   |   ST_MAN   |  5800  |     1      |       50      |      5      |
| 26 |    Julia    |    Nayer    |  ST_CLERK  |  3200  |     21     |       50      |      6      |
| 27 |    Irene    | Mikkilineni |  ST_CLERK  |  2700  |     21     |       50      |      7      |
| 28 |    James    |    Landry   |  ST_CLERK  |  2400  |     21     |       50      |      8      |
| 29 |    Steven   |    Markle   |  ST_CLERK  |  2200  |     21     |       50      |      9      |
| 30 |    Laura    |    Bissot   |  ST_CLERK  |  3300  |     22     |       50      |      10     |
| 31 |    Mozhe    |   Atkinson  |  ST_CLERK  |  2800  |     22     |       50      |      1      |
| 32 |    James    |    Marlow   |  ST_CLERK  |  2500  |     22     |       50      |      2      |
| 33 |      TJ     |    Olson    |  ST_CLERK  |  2100  |     22     |       50      |      3      |
| 34 |    Jason    |    Mallin   |  ST_CLERK  |  3300  |     23     |       50      |      4      |
| 35 |   Michael   |    Rogers   |  ST_CLERK  |  2900  |     23     |       50      |      5      |
| 36 |      Ki     |     Gee     |  ST_CLERK  |  2400  |     23     |       50      |      6      |
| 37 |    Hazel    |  Philtanker |  ST_CLERK  |  2200  |     23     |       50      |      7      |
| 38 |    Renske   |    Ladwig   |  ST_CLERK  |  3600  |     24     |       50      |      8      |
| 39 |   Stephen   |    Stiles   |  ST_CLERK  |  3200  |     24     |       50      |      9      |
| 40 |     John    |     Seo     |  ST_CLERK  |  2700  |     24     |       50      |      10     |
| 41 |    Joshua   |    Patel    |  ST_CLERK  |  2500  |     24     |       50      |      1      |
| 42 |    Trenna   |     Rajs    |  ST_CLERK  |  3500  |     25     |       50      |      2      |
| 43 |    Curtis   |    Davies   |  ST_CLERK  |  3100  |     25     |       50      |      3      |
| 44 |   Randall   |    Matos    |  ST_CLERK  |  2600  |     25     |       50      |      4      |
| 45 |    Peter    |    Vargas   |  ST_CLERK  |  2500  |     25     |       50      |      5      |
| 46 |     John    |   Russell   |   SA_MAN   | 14000  |     1      |       80      |      6      |
| 47 |    Karen    |   Partners  |   SA_MAN   | 13500  |     1      |       80      |      7      |
| 48 |   Alberto   |  Errazuriz  |   SA_MAN   | 12000  |     1      |       80      |      8      |
| 49 |    Gerald   |  Cambrault  |   SA_MAN   | 11000  |     1      |       80      |      9      |
| 50 |    Eleni    |   Zlotkey   |   SA_MAN   | 10500  |     1      |       80      |      10     |
| 51 |   Jennifer  |    Whalen   |  AD_ASST   |  4400  |     2      |       10      |      1      |
| 52 |   Michael   |  Hartstein  |   MK_MAN   | 13000  |     1      |       20      |      2      |
| 53 |    Susan    |    Mavris   |   HR_REP   |  6500  |     2      |       40      |      3      |
+----+-------------+-------------+------------+--------+------------+---------------+-------------+

In [27]:
res = await db.execute("""
    select employee_id, first_name || ' ' || last_name as full_name
    from employees
    where last_name like '% %';
""")

print_table(["id", "full_name"], res.fetchall())

+----+-------------+
| id |  full_name  |
+----+-------------+
| 3  | Lex De Haan |
+----+-------------+

In [28]:
res = await db.execute("""
    select department_name, min(salary) as min_salary
    from employees
    join departments using(department_id)
    group by department_name
    having min(salary) > 10000
    order by min_salary desc;
""")

print_table(["department_name", "min_salary"], res.fetchall())

+-----------------+------------+
| department_name | min_salary |
+-----------------+------------+
|    Executive    |   17000    |
|    Marketing    |   13000    |
|      Sales      |   10500    |
+-----------------+------------+

In [32]:
res = await db.execute("""
    select city, count(employee_id) as employees_count, round(avg(salary), 2) as salary_avg
    from employees
    join locations using(location_id)
    group by city
    order by salary_avg desc;
""")

print_table(["city", "employees_count", "salary_avg"], res.fetchall())

+---------------------+-----------------+------------+
|         city        | employees_count | salary_avg |
+---------------------+-----------------+------------+
|        Venice       |        6        |  8650.00   |
|         Roma        |        6        |  8316.67   |
|        Tokyo        |        6        |  7400.00   |
|       Toronto       |        5        |  6201.60   |
|      Hiroshima      |        5        |  5660.00   |
|      Southlake      |        5        |  5640.00   |
|      Whitehorse     |        5        |  5600.00   |
| South San Francisco |        5        |  5500.00   |
|   South Brunswick   |        5        |  5220.00   |
|       Seattle       |        5        |  5000.00   |
+---------------------+-----------------+------------+

In [5]:
res = await db.execute("""
    select * from select_data(30);
""")

print_table(["department_id", "department_name", "manager_id"], res.fetchall())

+---------------+-----------------+------------+
| department_id | department_name | manager_id |
+---------------+-----------------+------------+
|       40      | Human Resources |     53     |
|       50      |     Shipping    |     22     |
|       60      |        IT       |     4      |
|       80      |      Sales      |     46     |
|       90      |    Executive    |     1      |
|      100      |     Finance     |     9      |
+---------------+-----------------+------------+

In [7]:
await db.execute("""
    create or replace function select_data_1(min_id int) returns setof departments as $$
        select *
        from departments
        where department_id > min_id;
    $$ language sql;
""")

res = await db.execute("""
    select *
    from select_data_1(30);
""")
print_table(["department_id", "department_name", "manager_id"], res.fetchall())

+---------------+-----------------+------------+
| department_id | department_name | manager_id |
+---------------+-----------------+------------+
|       40      | Human Resources |     53     |
|       50      |     Shipping    |     22     |
|       60      |        IT       |     4      |
|       80      |      Sales      |     46     |
|       90      |    Executive    |     1      |
|      100      |     Finance     |     9      |
+---------------+-----------------+------------+

In [9]:
res = await db.execute("""
    select * from get_job_stats_pg();
""")

print_table(["job_title", "employees_count"], res.fetchall())

+--------------------------------+-----------------+
|           job_title            | employees_count |
+--------------------------------+-----------------+
|          Stock Clerk           |        20       |
|        Purchasing Clerk        |        5        |
|         Sales Manager          |        5        |
|         Stock Manager          |        5        |
|           Accountant           |        5        |
|           Programmer           |        5        |
| Administration Vice President  |        2        |
|        Finance Manager         |        1        |
|           President            |        1        |
| Human Resources Representative |        1        |
|    Administration Assistant    |        1        |
|       Marketing Manager        |        1        |
|       Purchasing Manager       |        1        |
+--------------------------------+-----------------+

In [10]:
await db.execute("""
    create or replace function get_job_stats_py()
    returns TABLE (job_title varchar(35), employees_count int)
    as $$
        select job_title, count(job_id) as employees_count
        from employees
        join jobs using(job_id)
        group by job_title
        order by employees_count desc;
    $$ language sql;
""")

res = await db.execute("""
    select *
    from get_job_stats_py();
""")

print_table(["job_title", "employees_count"], res.fetchall())

+--------------------------------+-----------------+
|           job_title            | employees_count |
+--------------------------------+-----------------+
|          Stock Clerk           |        20       |
|        Purchasing Clerk        |        5        |
|         Sales Manager          |        5        |
|         Stock Manager          |        5        |
|           Accountant           |        5        |
|           Programmer           |        5        |
| Administration Vice President  |        2        |
|        Finance Manager         |        1        |
|           President            |        1        |
| Human Resources Representative |        1        |
|    Administration Assistant    |        1        |
|       Marketing Manager        |        1        |
|       Purchasing Manager       |        1        |
+--------------------------------+-----------------+